ANSWER = {
    'A': ["アーモンド", "ウナギ", "卵", "チーズ", "マッシュルーム", "きくらげ", "のり", "わかめ", "アワビ"],
    'B': ["唐辛子", "ニンニク", "ピスタチオ", "マグロ", "かつお", "さんま", "バナナ", "にんにく", "さけかす"],
    'C': ["キャベツ", "チンゲンサイ", "オクラ", "豆腐", "牛乳", "枝豆", "ブロッコリー", "ししゃも", "ヨーグルト", "チーズ"],
    'D': ["納豆", "レバー", "すじこ", "アボカド", "黒砂糖", "オートミール", "しめじ", "たらこ", "脱脂粉乳", "玉露"],
    'E': ["レモン", "ピーマン", "キウイ", "ゴーヤ", "パプリカ", "かぼちゃ", "柿", "ブロッコリー", "キャベツ", "いちご"],
    'F': ["豚肉", "ゴマ", "海苔", "ピーナッツ", "大豆", "玄米", "クリ", "菊", "落花生", "がぶ", "グリンピース"],
    'F1': ["うなぎ", "豚肉", "にんじん", "にら", "さつまいも", "ケール",  "ほうれんそう", "干しあんず", "マスクメロン", "マンゴー"],
    'F2': ["まぐろ", "たらこ", "ツナ缶", "焼き豚", "まいたけ", "エリンギ", "ぶなしめじ", "なめこ", "さば", "小麦", "そら豆"],
    'F3': ["アーモンド", "ウナギ", "卵", "チーズ", "しじみ", "ウニ", "牛乳", "パッションフルーツ", "ライチ", "グアバ"],
    'G': ["モロヘイヤ", "シソ", "カニ", "ウニ", "アーモンド", "ヘーゼルナッツ", "ひまわり油", "イカ", "ブリ", "すじこ"]
}

VITAMIN = {
    'A': "ビタミンB2",
    'B': "ビタミンB6",
    'C': "カルシウム",
    'D': "バントテン酸",
    'E': "ビタミンC",
    'F': "ビタミンB1",
    'F1': "ビタミンA",
    'F2': "ナイアシン",
    'F3': "ビタミンB2",
    'G': "ビタミンE"
}
